Revit 2026 API

# TileTileBrickType Property

---

The property labeled "Type" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileBrickType { get; }
```
```vb
Public Shared ReadOnly Property TileBrickType As String
	Get
```
```cpp
public:
static property String^ TileBrickType {
	String^ get ();
}
```
```fsharp
static member TileBrickType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "TileBrickType".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace